<?xml version="1.0" standalone="yes"?>
<Документ>
  <diffgr:diffgram xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1">
    <dsMMISDB xmlns="http://tempuri.org/dsMMISDB.xsd">
      <ООП diffgr:id="ООП1" msdata:rowOrder="0" Код="1" Шифр="09.02.07" Название="Информационные системы и программирование" />
      <ООП diffgr:id="ООП2" msdata:rowOrder="1" Код="2" КодРодителя="1" Название="Программист" />
      <Планы diffgr:id="Планы1" msdata:rowOrder="0" КодПлана="7" КодООП="1" ГодНачалаПодготовки="2025" КодФормыОбучения="1" СрокОбучения="3г 10м" Квалификация="Программист" ДатаГОСа="2016-12-09T00:00:00+03:00" НомерГОСа="1547" />
      <СправочникФормаОбучения diffgr:id="Ф1" Код="1" ФормаОбучения="Очная" />
      <СправочникВидыРабот Код="101" Название="Лекционные занятия" Аббревиатура="Лек" />
      <СправочникВидыРабот Код="103" Название="Практические занятия" Аббревиатура="Пр" />
      <СправочникВидыРабот Код="102" Название="Лабораторные занятия" Аббревиатура="Лаб" />
      <СправочникВидыРабот Код="107" Название="Самостоятельная работа" Аббревиатура="СР" />
      <СправочникВидыРабот Код="108" Название="Консультации" Аббревиатура="Конс" />
      <СправочникВидыРабот Код="140" Название="Промежуточная аттестация" Аббревиатура="ПА" />
      <СправочникВидыРабот Код="150" Название="Часы в интерактивной форме" Аббревиатура="Инт" />
      <СправочникВидыРабот Код="1" Название="Экзамен" Аббревиатура="Эк" />
      <СправочникВидыРабот Код="2" Название="Зачет" Аббревиатура="За" />
      <СправочникВидыРабот Код="3" Название="Дифференцированный зачет" Аббревиатура="ДЗ" />
      <СправочникВидыРабот Код="5" Название="Курсовой проект" Аббревиатура="КП" />
      <СправочникВидыРабот Код="6" Название="Экзамен квалификационный" Аббревиатура="Эк(к)" />
      <СправочникВидыРабот Код="200" Название="Практика" Аббревиатура="Практ" />
      <ПланыСтроки Код="10" КодПлана="7" ДисциплинаКод="СГ" Дисциплина="Социально-гуманитарный цикл" />
      <ПланыСтроки Код="11" КодПлана="7" ДисциплинаКод="СГ.01" Дисциплина="История России" КодРодителя="10" />
      <ПланыСтроки Код="12" КодПлана="7" ДисциплинаКод="ОП.01" Дисциплина="Операционные системы и среды" />
      <ПланыСтроки Код="20" КодПлана="7" ДисциплинаКод="ПМ.01" Дисциплина="Разработка модулей программного обеспечения" />
      <ПланыСтроки Код="21" КодПлана="7" ДисциплинаКод="МДК.01.01" Дисциплина="Разработка программных модулей" КодРодителя="20" />
      <ПланыСтроки Код="22" КодПлана="7" ДисциплинаКод="УП.01.01" Дисциплина="Учебная практика" КодРодителя="20" />
      <ПланыСтроки Код="23" КодПлана="7" ДисциплинаКод="ПП.01.01" Дисциплина="Производственная практика" КодРодителя="20" />
      <ПланыНовыеЧасы Код="1" КодОбъекта="11" КодТипаЧасов="1" Курс="1" Семестр="1" КодВидаРабот="101" Количество="20" />
      <ПланыНовыеЧасы Код="2" КодОбъекта="11" КодТипаЧасов="1" Курс="1" Семестр="1" КодВидаРабот="103" Количество="12" />
      <ПланыНовыеЧасы Код="3" КодОбъекта="11" КодТипаЧасов="1" Курс="1" Семестр="1" КодВидаРабот="3" Количество="1" />
      <ПланыНовыеЧасы Код="4" КодОбъекта="11" КодТипаЧасов="2" Курс="1" Семестр="1" КодВидаРабот="150" Количество="8" />
      <ПланыНовыеЧасы Код="5" КодОбъекта="12" КодТипаЧасов="1" Курс="2" Семестр="1" КодВидаРабот="101" Количество="30" />
      <ПланыНовыеЧасы Код="6" КодОбъекта="12" КодТипаЧасов="1" Курс="2" Семестр="1" КодВидаРабот="102" Количество="40" />
      <ПланыНовыеЧасы Код="7" КодОбъекта="12" КодТипаЧасов="1" Курс="2" Семестр="1" КодВидаРабот="108" Количество="2" />
      <ПланыНовыеЧасы Код="8" КодОбъекта="12" КодТипаЧасов="1" Курс="2" Семестр="1" КодВидаРабот="140" Количество="6" />
      <ПланыНовыеЧасы Код="9" КодОбъекта="12" КодТипаЧасов="1" Курс="2" Семестр="1" КодВидаРабот="1" Количество="1" />
      <ПланыНовыеЧасы Код="10" КодОбъекта="21" КодТипаЧасов="1" Курс="2" Семестр="2" КодВидаРабот="101" Количество="48" />
      <ПланыНовыеЧасы Код="11" КодОбъекта="21" КодТипаЧасов="1" Курс="2" Семестр="2" КодВидаРабот="103" Количество="60" />
      <ПланыНовыеЧасы Код="12" КодОбъекта="21" КодТипаЧасов="1" Курс="2" Семестр="2" КодВидаРабот="5" Количество="1" />
      <ПланыНовыеЧасы Код="13" КодОбъекта="22" КодТипаЧасов="1" Курс="2" Семестр="2" КодВидаРабот="200" Количество="72" />
      <ПланыНовыеЧасы Код="14" КодОбъекта="22" КодТипаЧасов="1" Курс="2" Семестр="2" КодВидаРабот="3" Количество="1" />
      <ПланыНовыеЧасы Код="15" КодОбъекта="23" КодТипаЧасов="1" Курс="3" Семестр="1" КодВидаРабот="200" Количество="144" />
      <ПланыНовыеЧасы Код="16" КодОбъекта="20" КодТипаЧасов="1" Курс="3" Семестр="1" КодВидаРабот="6" Количество="1" />
    </dsMMISDB>
  </diffgr:diffgram>
</Документ>
